'use client';

import { HandySvg } from 'handy-svg'
import styles from './address.module.scss';

export function Address() {
  return (
    <section className={styles.address}>
      <div className={styles.inner}>
        <div className={styles.title}>Адрес</div>
        <p className={styles.text}>
          Нижегородская обл., Нижний Новгород, пр-т Гагарина, 3
        </p>
        <div className={styles.content}>
          <ul className={'list-reset ' + styles.list}>
            <li className={styles.item}>
              <p className={styles.text}>
                <i className={styles.dot} style={{ backgroundColor: 'red' }} />
                Горьковская
                <svg
                  viewBox='0 0 24 24'
                  width={16}
                  height={16}
                  fill='#8f8f8f'
                >
                  <path d='M16.13 2.8c-.24 1.28-1.42 2.1-2.81 1.88a2.38 2.38 0 0 1-1.85-2.84 2.38 2.38 0 0 1 4.66.97ZM8.78 15.45 3.44 20.9a1.5 1.5 0 0 0 .1 2.21c.68.59 1.74.54 2.37-.1L11 17.83l-1.7-1.45c-.29-.25-.47-.58-.52-.93Zm-2.73-2.8c.71.53 1.73.38 2.26-.31l2.35-3.06.12-.04-.99 5.2c-.1.52.1 1.03.47 1.38.07.08.14.15.23.22l3.55 2.84 1.87 4.17c.36.8 1.34 1.17 2.2.84a1.53 1.53 0 0 0 .89-2.05l-2.02-4.52c-.1-.22-.26-.42-.46-.58l-3.27-2.61.67-3.54.76.88c.23.26.53.45.88.54l3.33.83c.9.22 1.82-.28 2.05-1.11.24-.84-.29-1.7-1.18-1.92l-2.8-.7-2.56-2.98a1.64 1.64 0 0 0-.44-.36A1.72 1.72 0 0 0 13 5.4c-.2-.01-.4 0-.6.07l-3.19.94c-.33.1-.61.3-.82.56l-2.67 3.47c-.53.7-.39 1.68.33 2.2Z' />
                </svg>
                <span>11-15 мин.</span>
              </p>
            </li>
            <li className={styles.item}>
              <p className={styles.text}>
                <i className={styles.dots} />
                Московская
                <svg
                  viewBox='0 0 24 24'
                  width={16}
                  height={16}
                  fill='#8f8f8f'
                >
                  <path d='M16.13 2.8c-.24 1.28-1.42 2.1-2.81 1.88a2.38 2.38 0 0 1-1.85-2.84 2.38 2.38 0 0 1 4.66.97ZM8.78 15.45 3.44 20.9a1.5 1.5 0 0 0 .1 2.21c.68.59 1.74.54 2.37-.1L11 17.83l-1.7-1.45c-.29-.25-.47-.58-.52-.93Zm-2.73-2.8c.71.53 1.73.38 2.26-.31l2.35-3.06.12-.04-.99 5.2c-.1.52.1 1.03.47 1.38.07.08.14.15.23.22l3.55 2.84 1.87 4.17c.36.8 1.34 1.17 2.2.84a1.53 1.53 0 0 0 .89-2.05l-2.02-4.52c-.1-.22-.26-.42-.46-.58l-3.27-2.61.67-3.54.76.88c.23.26.53.45.88.54l3.33.83c.9.22 1.82-.28 2.05-1.11.24-.84-.29-1.7-1.18-1.92l-2.8-.7-2.56-2.98a1.64 1.64 0 0 0-.44-.36A1.72 1.72 0 0 0 13 5.4c-.2-.01-.4 0-.6.07l-3.19.94c-.33.1-.61.3-.82.56l-2.67 3.47c-.53.7-.39 1.68.33 2.2Z' />
                </svg>
                <span>от 31 мин.</span>
              </p>
            </li>
            <li className={styles.item}>
              <p className={styles.text}>
                <i className={styles.dot} style={{ backgroundColor: 'red' }} />
                Чкаловская
                <svg
                  viewBox='0 0 24 24'
                  width={16}
                  height={16}
                  fill='#8f8f8f'
                >
                  <path d='M16.13 2.8c-.24 1.28-1.42 2.1-2.81 1.88a2.38 2.38 0 0 1-1.85-2.84 2.38 2.38 0 0 1 4.66.97ZM8.78 15.45 3.44 20.9a1.5 1.5 0 0 0 .1 2.21c.68.59 1.74.54 2.37-.1L11 17.83l-1.7-1.45c-.29-.25-.47-.58-.52-.93Zm-2.73-2.8c.71.53 1.73.38 2.26-.31l2.35-3.06.12-.04-.99 5.2c-.1.52.1 1.03.47 1.38.07.08.14.15.23.22l3.55 2.84 1.87 4.17c.36.8 1.34 1.17 2.2.84a1.53 1.53 0 0 0 .89-2.05l-2.02-4.52c-.1-.22-.26-.42-.46-.58l-3.27-2.61.67-3.54.76.88c.23.26.53.45.88.54l3.33.83c.9.22 1.82-.28 2.05-1.11.24-.84-.29-1.7-1.18-1.92l-2.8-.7-2.56-2.98a1.64 1.64 0 0 0-.44-.36A1.72 1.72 0 0 0 13 5.4c-.2-.01-.4 0-.6.07l-3.19.94c-.33.1-.61.3-.82.56l-2.67 3.47c-.53.7-.39 1.68.33 2.2Z' />
                </svg>
                <span>от 31 мин.</span>
              </p>
            </li>
          </ul>
          <button type='button' className={'btn-reset ' + styles.btn}>
            Показать карту
            <HandySvg src='/img/arrow-3.svg' width={16} height={16} />
          </button>
        </div>
      </div>
    </section>
  );
}
