interface AdvanceProps {
    title: string;
    img: string;
    text: string;
    link: string;
  }
  
  export const ADVANCE: AdvanceProps[] = [
      {
          title: 'Kangaroo Pro',
          img: '/img/static/pro.svg',
          text: 'Профессиональный кабинет для работы с объявлениями. Здесь удобно смотреть статистику, планировать продвижение и работать с прочими инструментами.',
          link: '#',
      },
      {
          title: 'Kangaroo Pro',
          img: '/img/static/pro.svg',
          text: 'Профессиональный кабинет для работы с объявлениями. Здесь удобно смотреть статистику, планировать продвижение и работать с прочими инструментами.',
          link: '#',
      },
      {
          title: 'Kangaroo Pro',
          img: '/img/static/pro.svg',
          text: 'Профессиональный кабинет для работы с объявлениями. Здесь удобно смотреть статистику, планировать продвижение и работать с прочими инструментами.',
          link: '#',
      },
      {
          title: 'Kangaroo Pro',
          img: '/img/static/pro.svg',
          text: 'Профессиональный кабинет для работы с объявлениями. Здесь удобно смотреть статистику, планировать продвижение и работать с прочими инструментами.',
          link: '#',
      },
  ];
  