'use client';

import styles from './description.module.scss';

export function Description() {
  return (
    <section className={styles.description}>
      <div className={styles.inner}>
        <div className={styles.title}>Описание</div>
        <div className={styles.content}>
          <p className={styles.text}>
            ЧЕХОЛ В ПОДАРОК🎁🎁🎁🎁
            <br />
            <br />
            РЕЙТИНГ Kangaroo ⭐️⭐️⭐️⭐️⭐️
            <br />
            🔥Более 350 отзывов🔥
            <br />
            ⚡Мы работаем на рынке 7 лет и хорошо зарекомендовали себя среди
            покупателей⚡
            <br />
            Обратившись к нам, вы получите новое, оригинальное, запакованное
            устройство!
            <br />
            <br />
            ✅ГОД ГАРАНТИЯ
            <br />
            ✅31 день на проверку устройства
            <br />
            ✅Оплата при получении
            <br />
            ✅Скидки постоянным клиентам
            <br />
            ✅Перед покупкой проверка на официальном сайте
            <br />
            ✅Перенос данных и удаленных приложений в подарок
            <br />
            ✅Трейд-Ин обмен старой техники на новую с доплатой
            <br />
            ✅Оплата по карте +5% комиссия
            <br />
            ✅Рассрочка
            <br />
            ✅Кредит
            <br />
            ✅САМОВЫВОЗ: каждый день с 08:00 до 23:00
            <br />
            ✅ДОСТАВКА: по Нижнему Новгороду при покупке аксессуаров БЕСПЛАТНО
            <br />
            ✅Отправка в регионы компанией СДЭК при 100% предоплате
            <br />
            Мы дорожим своей репутацией и гарантируем, что наш товар
            исключительно новый и оригинальный. Всегда на связи!
            <br />
            ‼Цена может меняться из-за курса доллара. Уточняйте наличие и цену в
            сообщениях, либо по телефону. Мы всегда проконсультируем и
            предложим, что лучше выбрать‼
          </p>
        </div>
      </div>
    </section>
  );
}
